// Copyright 2022 The Go Authors. All rights reserved.
// Use of this source code is governed by a BSD-style
// license that can be found in the LICENSE file.

//go:build goexperiment.arenas

/*
arenaパッケージは、Goの値のコレクションのためのメモリを割り当て、その領域を
手動で一度にまとめて安全に解放する機能を提供します。この機能の目的は効率の向上です。
ガベージコレクションの前にメモリを手動で解放すると、そのサイクルが遅れます。
サイクルの頻度が下がれば、ガベージコレクタのCPUコストが発生する頻度も下がります。

このパッケージの機能は、主にArena型に集約されています。
ArenaはGoの値のために大きなメモリチャンクを割り当てるため、小さなGoの値を
少量だけ割り当てる用途には非効率になりがちです。1回の使用ごとにMiB単位のメモリを
割り当てるような、まとまった使い方に最も適しています。

このような限定的な形での手動メモリ割り当てを許可することで、通常のGoの値でも
解放後使用（use-after-free）のバグが起こりうることに注意してください。このパッケージは、
解放されたメモリ領域を、ガベージコレクタが安全であると判断できるまで再利用しないことで、
こうした解放後使用のバグの影響を抑えています。通常、解放後使用のバグはフォールトと
有用なエラーメッセージを引き起こしますが、このパッケージは解放されたメモリに対して
フォールトを強制しない権利を留保しています。つまり、ランタイムが通常行うのと同じ方法で
すべてのメモリを割り当てるだけでも、このパッケージの有効な実装となります。実際、
一部のGoの値については、時折そのようにする権利を留保しています。
*/
package arena

import (
	"github.com/shogo82148/std/unsafe"
)

// Arenaは、まとめて割り当てられ、まとめて解放されるGoの値のコレクションを表します。
// Arenaは手動でランタイムに解放できるため、効率の向上に役立ちますが、
// 解放されたArenaから取得したメモリには、解放後にアクセスしてはいけません。
// Arenaは参照されなくなると自動的に解放されるため、そこから割り当てられたメモリが
// 不要になるまで生存させておく必要があります（runtime.KeepAliveを参照）。
//
// Arenaを複数のゴルーチンから並行して使用してはいけません。
type Arena struct {
	a unsafe.Pointer
}

// NewArenaは新しいArenaを割り当てます。
func NewArena() *Arena

// FreeはArena（およびArenaから割り当てられたすべてのオブジェクト）を解放し、
// Arenaを支えるメモリをガベージコレクションのオーバーヘッドなしにかなり速やかに
// 再利用できるようにします。アプリケーションは、解放後にこのArenaのメソッドを
// 呼び出してはいけません。
func (a *Arena) Free()

// Newは、指定されたArenaに新しい*Tを作成します。*TはArenaが解放された後に
// 使用してはいけません。解放後に値にアクセスするとフォールトが発生する可能性がありますが、
// このフォールトも保証されていません。
func New[T any](a *Arena) *T

// MakeSliceは、指定された容量と長さを持つ新しい[]Tを作成します。[]TはArenaが
// 解放された後に使用してはいけません。解放後にスライスの基礎となるストレージに
// アクセスするとフォールトが発生する可能性がありますが、このフォールトも保証されていません。
func MakeSlice[T any](a *Arena, len, cap int) []T

// Cloneは、入力値の浅いコピーを作成し、そのコピーを返します。コピーは、
// 元の値が割り当てられたArenaにはもはや束縛されません。元の値がArenaから
// 割り当てられていない場合は、そのまま返されます。この関数は、Arenaで割り当てられた値を
// そのArenaよりも長く生存させるのに役立ちます。
// Tはポインタ、スライス、文字列のいずれかでなければならず、そうでない場合この関数はパニックします。
func Clone[T any](s T) T
