// Copyright 2024 The Go Authors. All rights reserved.
// Use of this source code is governed by a BSD-style
// license that can be found in the LICENSE file.

package runtime

// AddCleanupは、ptrにクリーンアップ関数を付加します。ptrが到達不能になった後のある時点で、
// ランタイムは別のゴルーチンでcleanup(arg)を呼び出します。
//
// 典型的な使用法は、ptrが基礎となるリソースをラップするオブジェクト
// （例えば、OSのファイルディスクリプターをラップするFileオブジェクト）であり、
// argが基礎となるリソース（例えば、OSのファイルディスクリプター）であり、
// クリーンアップ関数が基礎となるリソースを解放する（例えば、closeシステムコールを呼び出す）
// というものです。
//
// ptrに対する制約はほとんどありません。特に、同じポインター、または同じ割り当て内の
// 異なるポインターに複数のクリーンアップを付加できます。
//
// ptrがcleanupまたはargから到達可能な場合、ptrは決して回収されず、
// クリーンアップは決して実行されません。この単純なケースに対する保護として、
// argがptrと等しい場合、AddCleanupはパニックを引き起こします。
//
// クリーンアップが実行される順序は規定されていません。
// 特に、複数のオブジェクトが互いを指し合っていて、すべてが同時に到達不能になった場合、
// それらのクリーンアップはすべて実行可能になり、任意の順序で実行される可能性があります。
// これはオブジェクトが循環を形成している場合でも同様です。
//
// クリーンアップは、ユーザーが作成したゴルーチンと並行して実行されます。
// クリーンアップは（ファイナライザとは異なり）互いに並行して実行される場合もあります。
// クリーンアップ関数が長時間実行する必要がある場合は、他のクリーンアップの実行を
// ブロックしないように新しいゴルーチンを作成するべきです。
//
// ptrがクリーンアップとファイナライザの両方を持つ場合、クリーンアップは
// ファイナライズされ、関連するファイナライザなしで到達不能になった後にのみ実行されます。
//
// cleanup(arg)の呼び出しは常に実行されることが保証されているわけではありません。
// 特に、プログラムの終了前に実行されることは保証されていません。
//
// Tのサイズがゼロバイトの場合、メモリー内の他のサイズゼロのオブジェクトと同じアドレスを
// 共有する可能性があるため、クリーンアップの実行は保証されません。
// https://go.dev/ref/spec#Size_and_alignment_guarantees を参照してください。
//
// パッケージレベル変数の初期化子で割り当てられたオブジェクトに対して
// クリーンアップが実行されることは保証されていません。そのようなオブジェクトは
// ヒープではなくリンカーによって割り当てられる場合があります。
//
// オブジェクトが参照されなくなってから任意に遠い将来にクリーンアップが実行される可能性があるため、
// ランタイムは、複数のオブジェクトを1つの割り当てスロットにまとめる
// 省スペースの最適化を実行することが許可されていることに注意してください。
// そのような割り当て内の参照されていないオブジェクトのクリーンアップは、
// それが常に参照されているオブジェクトと同じバッチ内に存在する場合、決して実行されない
// 可能性があります。通常、このバッチ処理は非常に小さい（16バイト以下程度の）
// ポインターを含まないオブジェクトに対してのみ行われます。
//
// クリーンアップは、オブジェクトが到達不能になるとすぐに実行される可能性があります。
// クリーンアップを正しく使用するには、プログラムはクリーンアップを実行しても
// 安全になるまでオブジェクトが到達可能であることを保証しなければなりません。
// グローバル変数に格納されたオブジェクト、またはグローバル変数からポインターをたどって
// 見つけられるオブジェクトは到達可能です。関数の引数やレシーバーは、関数がそれに
// 最後に言及した時点で到達不能になる可能性があります。クリーンアップが早期に
// 呼び出されないようにするには、オブジェクトが到達可能であり続けなければならない
// 最後の時点の後で、そのオブジェクトを [KeepAlive] 関数に渡してください。
//
//go:nocheckptr
func AddCleanup[T, S any](ptr *T, cleanup func(S), arg S) Cleanup

// Cleanupは、特定のオブジェクトに対するクリーンアップ呼び出しへのハンドルです。
type Cleanup struct {
	// id is the unique identifier for the cleanup within the arena.
	id uint64
	// ptr contains the pointer to the object.
	ptr uintptr
}

// Stopはクリーンアップ呼び出しをキャンセルします。クリーンアップ呼び出しが
// （ptrが到達不能になったために）すでに実行のためにキューに入れられている場合、Stopは何もしません。
// Stopがクリーンアップ関数を確実に削除するようにするには、呼び出し元は
// AddCleanupに渡されたポインターがStopの呼び出しの間到達可能であることを保証しなければなりません。
func (c Cleanup) Stop()
