// Copyright 2024 The Go Authors. All rights reserved.
// Use of this source code is governed by a BSD-style
// license that can be found in the LICENSE file.

//go:build goexperiment.runtimesecret

package secret

// Doはfを呼び出します。
//
// Doは、fが使用した一時的なストレージが適時に消去されることを保証します。
// （この文脈では、"f"はfによって開始された呼び出しツリー全体の略です。）
//   - fが使用したレジスタは、Doが戻る前に消去されます。
//   - fが使用したスタックは、Doが戻る前に消去されます。
//   - fが行ったヒープ割り当ては、割り当てられたすべての値がもはや到達不能であることを
//     ガベージコレクタが認識するとすぐに消去されます。
//   - Doは、fがパニックしたりruntime.Goexitを呼び出したりした場合でも機能します。
//     その一環として、fが発生させたパニックはDo自体から発生したかのように見えます。
//
// fの実行中に生成されたゴルーチンは、ゴルーチン全体が別のDoの呼び出しで
// ラップされているかのように動作します。
//
// ユーザーはDo内での割り当てに注意するべきです。
// Doが戻った後にヒープメモリを消去すると、ガベージコレクタのスイープ時間が増加する可能性があり、
// 消去されるまで割り当てを追跡するための追加のメモリが必要になります。
// スライスへの追加やマップへの挿入のように、値を拡張するために割り当てが行われる場合、
// これらのコストは累積する可能性があります。このような場合、秘密の部分だけでなく
// 新しい割り当て全体が消去されます。
//
// 割り当ての生存期間を短くし、予期しないパフォーマンスの問題を回避するために、
// Doによって呼び出される関数が消去されるべきでない結果を生成する必要がある場合は、
// 呼び出し元が作成した割り当てに結果をコピーすることでそうするべきです。
//
// 制限事項:
//   - 現在、linux/amd64とlinux/arm64でのみサポートされています。サポートされていない
//     プラットフォームでは、Doはfを直接呼び出します。
//   - fによって書き込まれたグローバル変数には保護が及びません。
//   - fがruntime.Goexitを呼び出した場合、コールスタックの上位にあるdeferによって
//     消去が遅れる可能性があります。
//   - ヒープ割り当ては、プログラムがそれらの割り当てへのすべての参照を破棄し、
//     ガベージコレクタがそれらの参照がなくなったことに気付いた場合にのみ消去されます。
//     前者はプログラムの制御下にありますが、後者はランタイム次第です。
//   - fによってパニックされた値は、f内からの割り当てを指している可能性があります。
//     それらの割り当ては、（少なくとも）パニックされた値が死ぬまで消去されません。
//   - ポインタアドレスが、ランタイムがガベージコレクションを実行するために使用する
//     データバッファに漏洩する可能性があります。ユーザーは機密情報をポインタに
//     エンコードするべきではありません。例えば、配列や構造体へのオフセットが機密である場合、
//     ユーザーはそのオブジェクトへのポインタを作成するべきではありません。この関数は
//     定数時間の暗号コードで使用することを意図しているため、この要件は通常暗黙的に満たされます。
func Do(f func())

// Enabledは、現在のゴルーチンがシークレットモードで実行されているかどうかを報告します。
// これは通常 [Do] の呼び出しによるものですが、すでにシークレットモードで実行されている
// ゴルーチンが別のゴルーチンを起動した場合にも発生する可能性があります。
func Enabled() bool
