// Copyright 2009 The Go Authors. All rights reserved.
// Use of this source code is governed by a BSD-style
// license that can be found in the LICENSE file.

package time

// Sleepは現在のゴルーチンを少なくともdの期間だけ一時停止します。
// 負数またはゼロの期間は、Sleepがすぐに戻る原因となります。
func Sleep(d Duration)

// Timer型は単一のイベントを表します。
// Timerが時間切れになると、現在の時間がCに送信されます。
// ただし、Timerが [AfterFunc] によって作成された場合は除きます。
// Timerは [NewTimer] またはAfterFuncで作成する必要があります。
type Timer struct {
	C    <-chan Time
	self *Timer
}

// Stopは [Timer] の発火を防ぎます。
// 呼び出しがタイマーを停止した場合はtrueを返し、タイマーがすでに期限切れまたは
// 停止されていた場合はfalseを返します。
//
// [AfterFunc](d, f)で作成された関数ベースのタイマーの場合、
// t.Stopがfalseを返したならば、タイマーはすでに期限切れになっており、
// 関数fは独自のゴルーチンで開始されています。
// Stopは戻る前にfの完了を待ちません。
// 呼び出し元がfが完了したかどうかを知る必要がある場合は、
// fと明示的に連携する必要があります。
//
// NewTimer(d)で作成されたチャネルベースのタイマーの場合、Go 1.23以降、
// Stopが戻った後のt.Cからの受信は、Stop以前の古い時刻値を受信するのではなく
// ブロックすることが保証されます。
// プログラムがまだt.Cから受信しておらず、タイマーが実行中の場合、
// Stopはtrueを返すことが保証されます。
// Go 1.23より前では、Stopを安全に使用する唯一の方法は、Stopがfalseを返した場合に
// 余分な<-t.Cを挿入して潜在的な古い値を排出することでした。
// 詳細については [NewTimer] のドキュメントを参照してください。
func (t *Timer) Stop() bool

// NewTimerは、少なくともdの期間経過後に、
// そのチャネルに現在の時刻を送信する新しいTimerを作成します。
//
// Go 1.23より前では、ガベージコレクターはまだ期限切れになっていない、または
// 停止されていないタイマーを回収しなかったため、タイマーが不要になったときに
// 回収できるように、コードではNewTimerを呼び出した直後にt.Stopをdeferすることが
// よくありました。
// Go 1.23以降、ガベージコレクターは、期限切れになっていない、または停止されていない
// タイマーであっても、参照されていなければ回収できます。
// ガベージコレクターを助けるためにStopメソッドを呼ぶ必要はもうありません。
// （もちろん、他の理由でタイマーを停止するためにStopを呼び出したい場合もあるでしょう。）
//
// Go 1.23より前では、Timerに関連付けられたチャネルは非同期（バッファー付き、容量1）
// であったため、 [Timer.Stop] や [Timer.Reset] が戻った後でも古い時刻の値を
// 受信する可能性がありました。
// Go 1.23以降、チャネルは同期（バッファーなし、容量0）になり、
// そのような古い値を受信する可能性はなくなりました。
func NewTimer(d Duration) *Timer

// Resetはタイマーを期間d後に期限切れにする。
// タイマーがアクティブであった場合はtrue、期限切れまたは停止された場合はfalseを返す。
//
// [AfterFunc](d, f) で作成された関数ベースのタイマーの場合、Resetはfが実行される
// 時刻を再スケジュールするか（この場合Resetはtrueを返します）、fが再び実行される
// ようにスケジュールします（この場合falseを返します）。
// Resetがfalseを返す場合、Resetは戻る前に以前のfの完了を待つことはなく、
// fを実行する後続のゴルーチンが以前のものと並行して実行されないことも保証しません。
// 呼び出し元が以前のfの実行が完了したかどうかを知る必要がある場合は、
// fと明示的に連携する必要があります。
//
// NewTimerで作成されたチャネルベースのタイマーの場合、Go 1.23以降、
// Resetが戻った後のt.Cからの受信では、以前のタイマー設定に対応する時刻の値を
// 受信しないことが保証されます。プログラムがまだt.Cから受信しておらず、
// タイマーが動作中であれば、Resetはtrueを返すことが保証されます。
// Go 1.23より前では、Resetを安全に使う唯一の方法は、まず [Timer.Stop] を呼び出して
// タイマーを明示的に空にすることでした。
// 詳細については、 [NewTimer] のドキュメントを参照してください。
func (t *Timer) Reset(d Duration) bool

// Afterは期間が経過するのを待ち、返されたチャネルに現在時刻を送信します。
// これは [NewTimer](d).Cと同等です。
//
// Go 1.23より前では、このドキュメントは、基礎となる [Timer] はタイマーが発火するまで
// ガベージコレクターによって回収されないこと、そして効率が問題になる場合は
// コードは代わりにNewTimerを使用し、タイマーが不要になったら [Timer.Stop] を
// 呼び出すべきであることを警告していました。
// Go 1.23以降、ガベージコレクターは参照されていない停止されていないタイマーを回収できます。
// Afterで十分な場合にNewTimerを優先する理由はありません。
func After(d Duration) <-chan Time

// AfterFuncは、指定した時間が経過した後、fを自身のゴルーチンで呼び出します。
// Stopメソッドを使用して呼び出しをキャンセルするために使用できる [Timer] を返します。
// 返されたTimerのCフィールドは使用されず、nilになります。
func AfterFunc(d Duration, f func()) *Timer
